{
  "kind": "build_request",
  "title": "Add 6 new uploaded photos to the proposal grid (same layout) and remove local upload UI/state",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-18",
      "text": "Add the 6 newly uploaded images as static frontend assets and ensure they are included in the build output with these exact filenames: IMG-20260208-WA0008-1.jpg, IMG-20260208-WA0010-1.jpg, IMG-20260208-WA0005-5.jpg, IMG-20260208-WA0008-2.jpg, IMG-20260208-WA0010-2.jpg, IMG-20260208-WA0005-6.jpg.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-uploads-1"
        ],
        "quotes": [
          "The user has uploaded 6 image(s): IMG-20260208-WA0008-1.jpg, IMG-20260208-WA0010-1.jpg, IMG-20260208-WA0005-5.jpg, IMG-20260208-WA0008-2.jpg, IMG-20260208-WA0010-2.jpg, IMG-20260208-WA0005-6.jpg."
        ]
      },
      "acceptanceCriteria": [
        "All 6 image files exist in the frontend static/public assets and are referenced by exact filename (case-sensitive).",
        "A production build includes the 6 images (no missing asset 404s for these filenames)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Keep the existing proposal page layout and interactions intact, but update the photo grid under the main /saesha.jpg image to display all 6 newly uploaded images as the smaller tiles (same grid style/spacing/rounded corners). Use a 2-column grid with 3 rows of small tiles under the main image (main image still spans both columns).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-user-1"
        ],
        "quotes": [
          "Same layout"
        ]
      },
      "acceptanceCriteria": [
        "The main /saesha.jpg image remains at the top of the card spanning both columns.",
        "Exactly 6 smaller photo tiles render under the main image in a 2-column grid (3 rows), using the 6 new uploaded static assets.",
        "YES/NO buttons behavior and the YES success screen remain unchanged."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Remove the in-page local photo upload functionality and its UI/state from the proposal page now that the grid is fully static: remove the hidden <input type=\"file\"> element, the \"Add photos/Replace photos\" button, the clear button, and any related local preview state usage in frontend/src/App.tsx. If the local preview hook is no longer used anywhere, remove its import/usage and clean up any now-unused code.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-user-1"
        ],
        "quotes": [
          "Same layout"
        ]
      },
      "acceptanceCriteria": [
        "No upload/replace/clear photo controls are visible in the UI.",
        "frontend/src/App.tsx no longer imports or uses useLocalPhotoTilePreviews, useRef for file input, lucide-react Upload/X icons, or any handlers solely for local photo uploads.",
        "The app compiles with no unused imports/variables related to local photo upload."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Preserve graceful fallback behavior for missing images: if any of the static photo assets (including /saesha.jpg) fail to load, render a visually consistent pink-themed placeholder tile that does not break the grid layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-user-1"
        ],
        "quotes": [
          "Same layout"
        ]
      },
      "acceptanceCriteria": [
        "If a small-tile image fails to load, that tile shows a placeholder with the same sizing/rounded corners as an image tile.",
        "If /saesha.jpg fails to load, the existing main-image placeholder behavior remains in place.",
        "No broken layout or console errors caused by image load failures (beyond standard 404s when simulating missing assets)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor; all Motoko logic stays in backend/main.mo (no new backend services).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not change the proposal copy, button labels, or the YES/NO interaction logic beyond what is required to remove the photo upload UI.",
    "No backend storage or image upload persistence is needed.",
    "No additional pages or routing changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}